mohammadfatemieh/SpecialTopics/4.development/1.CCS_workspace/tirtos_builds_CC1350_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm3g.c
/* Module__gatePrms__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms)0);

/* Module__id__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C = (xdc_Bits16)0x31;

/* Module__loggerDefined__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8)0);

/* Object__count__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count__C = 0;

/* Object__heap__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap__C = 0;

/* Object__sizeof__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof__C = 0;

/* Object__table__C */
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table__C = 0;


/*
 * ======== ti.sysbios.rts.gnu.ReentSupport INITIALIZERS ========
 */

/* Module__state__V */
#if defined (__ICCARM__)
#pragma location = ".data_ti_sysbios_rts_gnu_ReentSupport_Module__state__V"
#endif
#if defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
#ifndef __TI_COMPILER_VERSION__
ti_sysbios_rts_gnu_ReentSupport_Module_State__ ti_sysbios_rts_gnu_ReentSupport_Module__state__V __attribute__ ((section(".data_ti_sysbios_rts_gnu_ReentSupport_Module__state__V")));
#endif
#endif
ti_sysbios_rts_gnu_ReentSupport_Module_State__ ti_sysbios_rts_gnu_ReentSupport_Module__state__V = {
    (xdc_Int)0x0,  /* taskHId */
    0,  /* lock */
};

/* Module__diagsEnabled__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C = (xdc_Bits32)0x90;

