mohammadfatemieh/SpecialTopics/4.development/1.CCS_workspace/tirtos_builds_CC1350_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm3g.c
/*
 * ======== ti.sysbios.posix.Settings PRAGMAS ========
 */

const CT__ti_sysbios_posix_Settings_Module__diagsEnabled ti_sysbios_posix_Settings_Module__diagsEnabled__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__diagsIncluded ti_sysbios_posix_Settings_Module__diagsIncluded__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__diagsMask ti_sysbios_posix_Settings_Module__diagsMask__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__gateObj ti_sysbios_posix_Settings_Module__gateObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__gatePrms ti_sysbios_posix_Settings_Module__gatePrms__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__id ti_sysbios_posix_Settings_Module__id__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerDefined ti_sysbios_posix_Settings_Module__loggerDefined__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerObj ti_sysbios_posix_Settings_Module__loggerObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerFxn0 ti_sysbios_posix_Settings_Module__loggerFxn0__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerFxn1 ti_sysbios_posix_Settings_Module__loggerFxn1__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerFxn2 ti_sysbios_posix_Settings_Module__loggerFxn2__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerFxn4 ti_sysbios_posix_Settings_Module__loggerFxn4__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Module__loggerFxn8 ti_sysbios_posix_Settings_Module__loggerFxn8__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Object__count ti_sysbios_posix_Settings_Object__count__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Object__heap ti_sysbios_posix_Settings_Object__heap__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Object__sizeof ti_sysbios_posix_Settings_Object__sizeof__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_Object__table ti_sysbios_posix_Settings_Object__table__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_supportsMutexPriority ti_sysbios_posix_Settings_supportsMutexPriority__C __attribute__ ((externally_visible));
const CT__ti_sysbios_posix_Settings_debug ti_sysbios_posix_Settings_debug__C __attribute__ ((externally_visible));
xdc_Bool ti_sysbios_posix_Settings_Module__startupDone__S(void) __attribute__ ((externally_visible));

/*
 * ======== ti.sysbios.rom.cortexm.cc13xx.CC13xx PRAGMAS ========
 */

const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn8__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__count__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__heap__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__sizeof__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table ti_sysbios_rom_cortexm_cc13xx_CC13xx_Object__table__C __attribute__ ((externally_visible));
xdc_Bool ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__startupDone__S(void) __attribute__ ((externally_visible));

/*
 * ======== ti.sysbios.rts.gnu.ReentSupport PRAGMAS ========
 */

const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gateObj ti_sysbios_rts_gnu_ReentSupport_Module__gateObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__id ti_sysbios_rts_gnu_ReentSupport_Module__id__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn4 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn4__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn8 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn8__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Object__count ti_sysbios_rts_gnu_ReentSupport_Object__count__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Object__heap ti_sysbios_rts_gnu_ReentSupport_Object__heap__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Object__sizeof ti_sysbios_rts_gnu_ReentSupport_Object__sizeof__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_Object__table ti_sysbios_rts_gnu_ReentSupport_Object__table__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_enableReentSupport ti_sysbios_rts_gnu_ReentSupport_enableReentSupport__C __attribute__ ((externally_visible));
const CT__ti_sysbios_rts_gnu_ReentSupport_A_badThreadType ti_sysbios_rts_gnu_ReentSupport_A_badThreadType__C __attribute__ ((externally_visible));
xdc_Bool ti_sysbios_rts_gnu_ReentSupport_Module__startupDone__S(void) __attribute__ ((externally_visible));

